# SlabShapeCreaseArray Constructor (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SlabShapeCreaseArray Constructor
SlabShapeCreaseArray Class See Also
---
Initializes a new instance of the SlabShapeCreaseArray class
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public SlabShapeCreaseArray()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
SlabShapeCreaseArray()
```

# See Also
SlabShapeCreaseArray Class
Autodesk.Revit.DB Namespace